Naptick/Naphome_Firmware/sdkconfig.defaults
# Naphome Phase 0.9 Firmware Configuration Defaults

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth - Enable NimBLE stack
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_MAX_CCCDS=8
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31
CONFIG_BT_NIMBLE_EXT_ADV=n

# Component config
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# I2C Configuration
CONFIG_I2C_ENABLE_DEBUG_LOG=n

# WiFi Configuration
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Flash Configuration - 8MB flash for ESP32-S3
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Partition Table - Use custom partition table with larger app partitions
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="config/partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="config/partitions.csv"

# Sensor Manager - Publish sensor data every 2 seconds for app monitoring
CONFIG_SENSOR_MANAGER_PUBLISH_INTERVAL_MS=2000
